#include "main.h"
//----------------------------------------------------------------------------------------------------
#include "dma.h"
#include "spi.h"
#include "usart.h"
#include "usb_device.h"
#include "gpio.h"
#include "usbd_cdc_if.h"
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
/*
*		Init Analog
*/
//----------------------------------------------------------------------------------------------------
void Init_Analog() //начальный запуск, задает работу с первым оптическим каналом и самое слабое затухание 
{
	HAL_GPIO_WritePin(GPIOH,GPIO_PIN_13,1);				//M1_ENN управление мультиплексором и выбор выходного канала (после мультиплексора стоит усилитель, далее ADC)
	HAL_GPIO_WritePin(GPIOH,GPIO_PIN_14,1);				//M1_A0
	HAL_GPIO_WritePin(GPIOH,GPIO_PIN_15,0);				//M1_A1
	PGA112(1); //настройка программируемого-усилителя (настройка его gain)
	channel_1(); //выбор оптического входа с помощью оптического ключа
	gain_1(); //выбор gain и настройка мультиплексора на какой-то выход
}
//----------------------------------------------------------------------------------------------------